Autodesk.Revit.DB.FabricationItemFile.IsUsedInternal
Checks to see if the item file is already in use in the project.
Note that this method may not provide the current status correctly. For normal case,
use the isUsed propery instead.
Since:
2019

Autodesk.Revit.DB.FabricationItemFile.IsLoaded
Checks to see if the item file has been loaded into the configuration.
Returns:
Returns true if the item file has been loaded into the configuration, false otherwise.
Since:
2019

Autodesk.Revit.DB.FabricationItemFile.IsValid
Checks to see if the item file is valid.
Returns:
Returns true if the item file is valid, false otherwise.
Since:
2019

Autodesk.Revit.DB.FabricationItemFile.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationItemFile.IsUsed
Checks to see if the item file is already in use in the project.
Since:
2019

Autodesk.Revit.DB.FabricationItemFile.Identifier
The string identifier for the item file. This string is unique and can be used to compare whether fabrication
item files are the same file.
Since:
2019

Autodesk.Revit.DB.FabricationItemFile.GetImage
Gets the image for the fabrication item file.
Returns: System.Drawing.Bitmap represents the fabrication item file image. null if there is no preview image.
Since: 2019

Autodesk.Revit.DB.FabricationItemFile
This class holds information about the item file, including whether it is already loaded from disk into Revit.
Remarks:
This object is created as a result of loading from disk.
Since:
2019